escamboapp/app/controllers/backoffice/admins_controller.rb

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO "admins" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    passwd = params[:admin][:password]
    passwd_confirmation = params[:admin][:password_confirmation]

    if passwd.blank? && passwd_confirmation.blank?
      params[:admin].delete(:password)
      params[:admin].delete(:password_confirmation)
    end

    if  @admin.update(params_admin)
---
UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "admin@admin.com.br"], ["updated_at", "2018-08-23 11:36:32.266672"], ["id", 1]]

  def destroy
    admin_email = @admin.email
    if  @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]