escamboapp/app/controllers/backoffice/categories_controller.rb

INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", ""], ["created_at", "2018-08-22 02:56:09.989957"], ["updated_at", "2018-08-22 02:56:09.989957"]]
---
  def create
    @category = CategoryService.create(params_category)

UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "Humanos"], ["updated_at", "2018-08-22 03:18:35.290837"], ["id", 11]]
---
  def update
    if  @category.update(params_category)